- Filering Bassed on String
- Adding new Column and Saving the File
- Cheaking Duplicates and Null Values in DF
- Handling Duplicates Values
- Handling Null Values
- Statistical Functions in Pandas
- Apply Function in DF
- Date Time and Timedelta
- Group by in DF

In [7]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Hannah","Sakib"],
    "City": ["New York", "Los Angeles", "Newark", "Boston", "New Delhi", "Chicago", "New Orleans", "Houston","H Los Ang"],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Marketing", "Finance", "HR", "HR"],
    "Salary": [50000, 60000, 55000, 70000, 52000, 58000, 62000, 51000,70000]
}

df=pd.DataFrame(data)

In [8]:
df

      Name         City Department  Salary
0    Alice     New York         HR   50000
1      Bob  Los Angeles         IT   60000
2  Charlie       Newark    Finance   55000
3    David       Boston         IT   70000
4      Eve    New Delhi         HR   52000
5    Frank      Chicago  Marketing   58000
6    Grace  New Orleans    Finance   62000
7   Hannah      Houston         HR   51000
8    Sakib    H Los Ang         HR   70000

In [9]:
# find new word

df.loc[df['City'].str.contains("New")]

      Name         City Department  Salary
0    Alice     New York         HR   50000
2  Charlie       Newark    Finance   55000
4      Eve    New Delhi         HR   52000
6    Grace  New Orleans    Finance   62000

In [ ]:
df.loc[df['City'].str.contains("new")]  # new er n small letter . so not found

Empty DataFrame
Columns: [Name, City, Department, Salary]
Index: []

In [12]:
df.loc[df['City'].str.contains("new",case=False)] # all time  case true thake

      Name         City Department  Salary
0    Alice     New York         HR   50000
2  Charlie       Newark    Finance   55000
4      Eve    New Delhi         HR   52000
6    Grace  New Orleans    Finance   62000

In [17]:
#   Find the los word from the data


df.loc[df['City'].str.contains(r"Los")]

    Name         City Department  Salary
1    Bob  Los Angeles         IT   60000
8  Sakib    H Los Ang         HR   70000

In [16]:
# starts with los

df.loc[df['City'].str.contains(r"^Los")]

  Name         City Department  Salary
1  Bob  Los Angeles         IT   60000

In [3]:
data = {
    "Name" :["Alice","Bob","Charlie"],
    "Age" :[25,30,35],
    "City":["New York","London","Paris"]
}
df=pd.DataFrame(data)

In [4]:
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [6]:
np.where(df['Data Structure Marks'] > 90, 'A+', 'A')

NameError: name 'np' is not defined